org/posts/shell-scripting.org
#+TITLE: Shell Scripting Q&A
#+DATE: 2026-06-15
#+TAGS: Shell, Linux, Scripting
#+DESCRIPTION: A comprehensive Q&A covering Shell Scripting from beginner to advanced level.
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="/static/css/style.css" type="text/css"/>

#+INCLUDE: "../header.org"

* Shell Scripting Q&A (Beginner to Advanced)

A comprehensive question and answer guide for Shell Scripting — from the very basics to advanced topics.
Use it to study, review, or prepare for interviews.

-----

* Beginner

** Q: What is a shell?

A shell is a command-line interpreter that provides an interface between the user and the operating system kernel.
It reads commands typed by the user and executes them.
Common shells include ~bash~, ~sh~, ~zsh~, ~fish~, and ~dash~.

** Q: What is a shell script?

A shell script is a plain text file containing a sequence of shell commands that are executed in order.
Shell scripts are used to automate repetitive tasks, manage files, and configure systems.

** Q: What is a shebang and why is it important?

The shebang (~#!~) is the first line of a shell script that tells the operating system which interpreter to use to execute the script.

#+BEGIN_SRC bash
#!/bin/bash
echo "Hello, World!"
#+END_SRC

Without the shebang the script may be run with the wrong shell or fail to execute directly.

** Q: How do you make a shell script executable?

#+BEGIN_SRC bash
chmod +x script.sh
./script.sh
#+END_SRC

~chmod +x~ adds execute permission, and ~./~ runs it from the current directory.

** Q: How do you print output to the terminal?

#+BEGIN_SRC bash
echo "Hello, World!"
printf "Name: %s\n" "Alice"
#+END_SRC

~echo~ is simple and appends a newline automatically.
~printf~ gives more control over formatting (similar to C's printf).

** Q: How do you define and use a variable?

#+BEGIN_SRC bash
name="Alice"
echo "Hello, ${name}"
#+END_SRC

- No spaces around ~=~ when assigning.
- Prefix the variable name with ~$~ to read its value.

** Q: What is the difference between single quotes and double quotes?

#+BEGIN_SRC bash
name="World"
echo 'Hello $name'   # prints: Hello $name  (no expansion)
echo "Hello $name"   # prints: Hello World  (variable expanded)
#+END_SRC

Single quotes treat everything literally.
Double quotes allow variable and command substitution.

** Q: How do you read input from the user?

#+BEGIN_SRC bash
read -p "Enter your name: " name
echo "Hello, $name"
#+END_SRC

~read~ stores the input in a variable.
~-p~ displays a prompt before waiting for input.

** Q: How do you write comments in a shell script?

#+BEGIN_SRC bash
# This is a single-line comment
echo "Running script..."  # inline comment
#+END_SRC

Only single-line comments (~#~) exist in shell.
There is no native multi-line comment syntax, but a heredoc trick is sometimes used.

** Q: How do you perform arithmetic in shell?

#+BEGIN_SRC bash
a=5
b=3
sum=$((a + b))
echo "Sum: $sum"        # prints: Sum: 8

# Alternative with expr
result=$(expr $a \* $b)
echo "Product: $result" # prints: Product: 15
#+END_SRC

~$((...))~ is the preferred modern syntax for integer arithmetic.

** Q: What are common comparison operators for numbers?

| Operator | Meaning                  |
|----------+--------------------------|
| ~-eq~    | Equal                    |
| ~-ne~    | Not equal                |
| ~-lt~    | Less than                |
| ~-le~    | Less than or equal       |
| ~-gt~    | Greater than             |
| ~-ge~    | Greater than or equal    |

#+BEGIN_SRC bash
if [ $a -gt $b ]; then
  echo "$a is greater than $b"
fi
#+END_SRC

** Q: How do you write an if-else statement?

#+BEGIN_SRC bash
age=18
if [ $age -ge 18 ]; then
  echo "Adult"
elif [ $age -ge 13 ]; then
  echo "Teenager"
else
  echo "Child"
fi
#+END_SRC

