public/posts/shell-scripting.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shell Scripting</title>
<meta name="description" content="A comprehensive Q&amp;A covering Shell Scripting from beginner to advanced level." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Shell Scripting</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-org4ac7eb5" class="outline-2">
<h2 id="org4ac7eb5">Shell Scripting Q&amp;A (Beginner to Advanced)</h2>
<div class="outline-text-2" id="text-org4ac7eb5">
<p>
A comprehensive question and answer guide for Shell Scripting — from the very basics to advanced topics.
Use it to study, review, or prepare for interviews.
</p>

<hr>
</div>
</div>
<div id="outline-container-orgb7b0d02" class="outline-2">
<h2 id="orgb7b0d02">Beginner</h2>
<div class="outline-text-2" id="text-orgb7b0d02">
</div>
<div id="outline-container-org4035332" class="outline-3">
<h3 id="org4035332">Q: What is a shell?</h3>
<div class="outline-text-3" id="text-org4035332">
<p>
A shell is a command-line interpreter that provides an interface between the user and the operating system kernel.
It reads commands typed by the user and executes them.
Common shells include <code>bash</code>, <code>sh</code>, <code>zsh</code>, <code>fish</code>, and <code>dash</code>.
</p>
</div>
</div>
<div id="outline-container-org1cd00e3" class="outline-3">
<h3 id="org1cd00e3">Q: What is a shell script?</h3>
<div class="outline-text-3" id="text-org1cd00e3">
<p>
A shell script is a plain text file containing a sequence of shell commands that are executed in order.
Shell scripts are used to automate repetitive tasks, manage files, and configure systems.
</p>
</div>
</div>
<div id="outline-container-org9d6b345" class="outline-3">
<h3 id="org9d6b345">Q: What is a shebang and why is it important?</h3>
<div class="outline-text-3" id="text-org9d6b345">
<p>
The shebang (<code>#!</code>) is the first line of a shell script that tells the operating system which interpreter to use to execute the script.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Hello, World!"</span>
</pre>
</div>

<p>
Without the shebang the script may be run with the wrong shell or fail to execute directly.
</p>
</div>
</div>
<div id="outline-container-orge50f1b0" class="outline-3">
<h3 id="orge50f1b0">Q: How do you make a shell script executable?</h3>
<div class="outline-text-3" id="text-orge50f1b0">
<div class="org-src-container">
<pre class="src src-bash">chmod +x script.sh
./script.sh
</pre>
</div>

<p>
<code>chmod +x</code> adds execute permission, and <code>./</code> runs it from the current directory.
</p>
</div>
</div>
<div id="outline-container-org2c1b722" class="outline-3">
<h3 id="org2c1b722">Q: How do you print output to the terminal?</h3>
<div class="outline-text-3" id="text-org2c1b722">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Hello, World!"</span>
printf <span style="font-style: italic;">"Name: %s\n"</span> <span style="font-style: italic;">"Alice"</span>
</pre>
</div>

<p>
<code>echo</code> is simple and appends a newline automatically.
<code>printf</code> gives more control over formatting (similar to C's printf).
</p>
</div>
</div>
<div id="outline-container-org904e37c" class="outline-3">
<h3 id="org904e37c">Q: How do you define and use a variable?</h3>
<div class="outline-text-3" id="text-org904e37c">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"Alice"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Hello, ${name}"</span>
</pre>
</div>

<ul class="org-ul">
<li>No spaces around <code>=</code> when assigning.</li>
<li>Prefix the variable name with <code>$</code> to read its value.</li>
</ul>
</div>
</div>
<div id="outline-container-org31610a6" class="outline-3">
<h3 id="org31610a6">Q: What is the difference between single quotes and double quotes?</h3>
<div class="outline-text-3" id="text-org31610a6">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"World"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'Hello $name'</span>   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">prints: Hello $name  (no expansion)
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Hello $name"</span>   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">prints: Hello World  (variable expanded)</span>
</pre>
</div>

<p>
Single quotes treat everything literally.
Double quotes allow variable and command substitution.
</p>
</div>
</div>
<div id="outline-container-orge09bb57" class="outline-3">
<h3 id="orge09bb57">Q: How do you read input from the user?</h3>
<div class="outline-text-3" id="text-orge09bb57">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">read</span> -p <span style="font-style: italic;">"Enter your name: "</span> name
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Hello, $name"</span>
</pre>
</div>

<p>
<code>read</code> stores the input in a variable.
<code>-p</code> displays a prompt before waiting for input.
</p>
</div>
</div>
<div id="outline-container-orga485bf7" class="outline-3">
<h3 id="orga485bf7">Q: How do you write comments in a shell script?</h3>
<div class="outline-text-3" id="text-orga485bf7">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">This is a single-line comment
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Running script..."</span>  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">inline comment</span>
</pre>
</div>

<p>
Only single-line comments (<code>#</code>) exist in shell.
There is no native multi-line comment syntax, but a heredoc trick is sometimes used.
</p>
</div>
</div>
<div id="outline-container-org84fdca7" class="outline-3">
<h3 id="org84fdca7">Q: How do you perform arithmetic in shell?</h3>
<div class="outline-text-3" id="text-org84fdca7">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">a</span>=5
<span style="font-weight: bold; font-style: italic;">b</span>=3
<span style="font-weight: bold; font-style: italic;">sum</span>=$((a + b))
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Sum: $sum"</span>        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">prints: Sum: 8
</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Alternative with expr
</span><span style="font-weight: bold; font-style: italic;">result</span>=$(expr $<span style="font-weight: bold; font-style: italic;">a</span> <span style="font-style: italic;">\*</span> $<span style="font-weight: bold; font-style: italic;">b</span>)
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Product: $result"</span> <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">prints: Product: 15</span>
</pre>
</div>

<p>
<code>$((...))</code> is the preferred modern syntax for integer arithmetic.
</p>
</div>
</div>
<div id="outline-container-org3624a0f" class="outline-3">
<h3 id="org3624a0f">Q: What are common comparison operators for numbers?</h3>
<div class="outline-text-3" id="text-org3624a0f">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-eq</code></td>
<td class="org-left">Equal</td>
</tr>

<tr>
<td class="org-left"><code>-ne</code></td>
<td class="org-left">Not equal</td>
</tr>

<tr>
<td class="org-left"><code>-lt</code></td>
<td class="org-left">Less than</td>
</tr>

<tr>
<td class="org-left"><code>-le</code></td>
<td class="org-left">Less than or equal</td>
</tr>

<tr>
<td class="org-left"><code>-gt</code></td>
<td class="org-left">Greater than</td>
</tr>

<tr>
<td class="org-left"><code>-ge</code></td>
<td class="org-left">Greater than or equal</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">if</span> [ $<span style="font-weight: bold; font-style: italic;">a</span> -gt $<span style="font-weight: bold; font-style: italic;">b</span> ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$a is greater than $b"</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1629192" class="outline-3">
<h3 id="org1629192">Q: How do you write an if-else statement?</h3>
<div class="outline-text-3" id="text-org1629192">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">age</span>=18
<span style="font-weight: bold;">if</span> [ $<span style="font-weight: bold; font-style: italic;">age</span> -ge 18 ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Adult"</span>
<span style="font-weight: bold;">elif</span> [ $<span style="font-weight: bold; font-style: italic;">age</span> -ge 13 ]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Teenager"</span>
<span style="font-weight: bold;">else</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Child"</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
