org/posts/shell-scripting.org
** Q: What are the basic loop types in shell?

#+BEGIN_SRC bash
# for loop
for i in 1 2 3 4 5; do
  echo "Number: $i"
done

# while loop
count=1
while [ $count -le 5 ]; do
  echo "Count: $count"
  ((count++))
done

# until loop (runs until condition becomes true)
until [ $count -gt 5 ]; do
  echo "Count: $count"
  ((count++))
done
#+END_SRC

** Q: What is $0, $1, $2 ... $@ and $#?

#+BEGIN_SRC bash
#!/bin/bash
echo "Script name : $0"
echo "First arg   : $1"
echo "Second arg  : $2"
echo "All args    : $@"
echo "Arg count   : $#"
#+END_SRC

| Variable | Meaning                              |
|----------+--------------------------------------|
| ~$0~     | Name of the script                   |
| ~$1~-~$9~| Positional parameters (arguments)    |
| ~$@~     | All arguments as separate strings    |
| ~$*~     | All arguments as a single string     |
| ~$#~     | Number of arguments                  |

** Q: What does $? represent?

~$?~ holds the exit status (return code) of the last executed command.
~0~ means success; any non-zero value means failure.

#+BEGIN_SRC bash
ls /nonexistent
echo "Exit code: $?"  # prints a non-zero value (e.g. 2)
#+END_SRC

-----

* Intermediate

** Q: What is the difference between [ ] and [[ ]]?

~[ ]~ is the POSIX-compliant test command available in all shells.
~[[ ]]~ is a bash/ksh/zsh extension that is more powerful and less error-prone.

#+BEGIN_SRC bash
# [[ ]] supports regex matching and logical operators without quoting issues
name="Alice"
if [[ $name == A* ]]; then
  echo "Name starts with A"
fi
#+END_SRC

Prefer ~[[ ]]~ in bash scripts for safety and additional features.

** Q: How do you define and call a function?

#+BEGIN_SRC bash
greet() {
  local name="$1"
  echo "Hello, $name!"
}

greet "Alice"
greet "Bob"
#+END_SRC

Use ~local~ to limit a variable's scope to the function.
Functions return an exit code (0–255), not a value — use ~echo~ to return data.

** Q: How do you capture the output of a command?

#+BEGIN_SRC bash
# Command substitution
today=$(date +%Y-%m-%d)
echo "Today is: $today"

# Backtick style (older, avoid)
files=`ls`
#+END_SRC

Prefer ~$(...)~ over backticks — it is more readable and supports nesting.

** Q: What is a heredoc and when do you use it?

A heredoc lets you pass a multi-line string to a command without creating a temporary file.

#+BEGIN_SRC bash
cat <<EOF
Line 1
Line 2
Today is $(date)
EOF
#+END_SRC

Use ~<<'EOF'~ (single-quoted delimiter) to disable variable expansion inside the heredoc.

** Q: How do arrays work in bash?

#+BEGIN_SRC bash
# Declare an array
fruits=("apple" "banana" "cherry")

echo "${fruits[0]}"     # apple
echo "${fruits[@]}"     # all elements
echo "${#fruits[@]}"    # number of elements

# Append an element
fruits+=("date")

# Loop over array
for fruit in "${fruits[@]}"; do
  echo "$fruit"
done
#+END_SRC

** Q: What is the difference between $@ and $* in arrays and functions?

When double-quoted:
- ~"$@"~ expands each element as a separate quoted word — safe for filenames with spaces.
- ~"$*"~ expands all elements as a single word joined by the first character of ~IFS~.

Always prefer ~"$@"~ when iterating over arguments or array elements.

** Q: What are special variables $$ and $!?

| Variable | Meaning                                  |
|----------+------------------------------------------|
| ~$$~     | PID of the current shell/script          |
| ~$!~     | PID of the last background command       |
| ~$-~     | Current shell option flags               |
| ~$_~     | Last argument of the previous command    |

