public/posts/shell-scripting.html
<div id="outline-container-orgbf5dd72" class="outline-3">
<h3 id="orgbf5dd72">Q: What are the basic loop types in shell?</h3>
<div class="outline-text-3" id="text-orgbf5dd72">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">for loop
</span><span style="font-weight: bold;">for</span> i<span style="font-weight: bold;"> in</span> 1 2 3 4 5; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Number: $i"</span>
<span style="font-weight: bold;">done</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">while loop
</span><span style="font-weight: bold; font-style: italic;">count</span>=1
<span style="font-weight: bold;">while</span> [ $<span style="font-weight: bold; font-style: italic;">count</span> -le 5 ]; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Count: $count"</span>
  ((count++))
<span style="font-weight: bold;">done</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">until loop (runs until condition becomes true)
</span><span style="font-weight: bold;">until</span> [ $<span style="font-weight: bold; font-style: italic;">count</span> -gt 5 ]; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Count: $count"</span>
  ((count++))
<span style="font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org08faa45" class="outline-3">
<h3 id="org08faa45">Q: What is $0, $1, $2 &#x2026; $@ and $#?</h3>
<div class="outline-text-3" id="text-org08faa45">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Script name : $0"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"First arg   : $1"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Second arg  : $2"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"All args    : $@"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Arg count   : $#"</span>
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>$0</code></td>
<td class="org-left">Name of the script</td>
</tr>

<tr>
<td class="org-left"><code>$1</code> to <code>$9</code></td>
<td class="org-left">Positional parameters (arguments)</td>
</tr>

<tr>
<td class="org-left"><code>$@</code></td>
<td class="org-left">All arguments as separate strings</td>
</tr>

<tr>
<td class="org-left"><code>$*</code></td>
<td class="org-left">All arguments as a single string</td>
</tr>

<tr>
<td class="org-left"><code>$#</code></td>
<td class="org-left">Number of arguments</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb8e421a" class="outline-3">
<h3 id="orgb8e421a">Q: What does $? represent?</h3>
<div class="outline-text-3" id="text-orgb8e421a">
<p>
<code>$?</code> holds the exit status (return code) of the last executed command.
<code>0</code> means success; any non-zero value means failure.
</p>

<div class="org-src-container">
<pre class="src src-bash">ls /nonexistent
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Exit code: $?"</span>  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">prints a non-zero value (e.g. 2)</span>
</pre>
</div>

<hr>
</div>
</div>
</div>
<div id="outline-container-org9b63289" class="outline-2">
<h2 id="org9b63289">Intermediate</h2>
<div class="outline-text-2" id="text-org9b63289">
</div>
<div id="outline-container-orge9922f3" class="outline-3">
<h3 id="orge9922f3">Q: What is the difference between <code>[ ]</code> and <code>[[ ]]</code>?</h3>
<div class="outline-text-3" id="text-orge9922f3">
<p>
<code>[ ]</code> is the POSIX-compliant test command available in all shells.
<code>[[ ]]</code> is a bash/ksh/zsh extension that is more powerful and less error-prone.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[[ ]] supports regex matching and logical operators without quoting issues
</span><span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"Alice"</span>
<span style="font-weight: bold;">if</span> [[ $<span style="font-weight: bold; font-style: italic;">name</span> == A* ]]; <span style="font-weight: bold;">then</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Name starts with A"</span>
<span style="font-weight: bold;">fi</span>
</pre>
</div>

<p>
Prefer <code>[[ ]]</code> in bash scripts for safety and additional features.
</p>
</div>
</div>
<div id="outline-container-org18fa1cb" class="outline-3">
<h3 id="org18fa1cb">Q: How do you define and call a function?</h3>
<div class="outline-text-3" id="text-org18fa1cb">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">greet</span>() {
  <span style="font-weight: bold;">local</span> <span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"$1"</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Hello, $name!"</span>
}

greet <span style="font-style: italic;">"Alice"</span>
greet <span style="font-style: italic;">"Bob"</span>
</pre>
</div>

<p>
Use <code>local</code> to limit a variable's scope to the function.
Functions return an exit code (0–255), not a value — use <code>echo</code> to return data.
</p>
</div>
</div>
<div id="outline-container-orgb3e4093" class="outline-3">
<h3 id="orgb3e4093">Q: How do you capture the output of a command?</h3>
<div class="outline-text-3" id="text-orgb3e4093">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Command substitution
</span><span style="font-weight: bold; font-style: italic;">today</span>=$(date +%Y-%m-%d)
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Today is: $today"</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Backtick style (older, avoid)
</span><span style="font-weight: bold; font-style: italic;">files</span>=<span style="font-weight: bold;">`ls`</span>
</pre>
</div>

<p>
Prefer <code>$(...)</code> over backticks — it is more readable and supports nesting.
</p>
</div>
</div>
<div id="outline-container-org2d041d1" class="outline-3">
<h3 id="org2d041d1">Q: What is a heredoc and when do you use it?</h3>
<div class="outline-text-3" id="text-org2d041d1">
<p>
A heredoc lets you pass a multi-line string to a command without creating a temporary file.
</p>

<div class="org-src-container">
<pre class="src src-bash">cat &lt;&lt;EOF<span style="font-weight: bold;">
Line 1
Line 2
Today is $(date)
EOF</span>
</pre>
</div>

<p>
Use <code>&lt;&lt;'EOF'</code> (single-quoted delimiter) to disable variable expansion inside the heredoc.
</p>
</div>
</div>
<div id="outline-container-org03cb558" class="outline-3">
<h3 id="org03cb558">Q: How do arrays work in bash?</h3>
<div class="outline-text-3" id="text-org03cb558">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Declare an array
</span><span style="font-weight: bold; font-style: italic;">fruits</span>=(<span style="font-style: italic;">"apple"</span> <span style="font-style: italic;">"banana"</span> <span style="font-style: italic;">"cherry"</span>)

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${fruits[0]}"</span>     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">apple
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${fruits[@]}"</span>     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">all elements
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${#fruits[@]}"</span>    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">number of elements
</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Append an element
</span><span style="font-weight: bold; font-style: italic;">fruits</span>+=(<span style="font-style: italic;">"date"</span>)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Loop over array
</span><span style="font-weight: bold;">for</span> fruit<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"${fruits[@]}"</span>; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$fruit"</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc2404b" class="outline-3">
<h3 id="orgdc2404b">Q: What is the difference between $@ and $* in arrays and functions?</h3>
<div class="outline-text-3" id="text-orgdc2404b">
<p>
When double-quoted:
</p>
<ul class="org-ul">
<li><code>"$@"</code> expands each element as a separate quoted word — safe for filenames with spaces.</li>
<li><code>"$*"</code> expands all elements as a single word joined by the first character of <code>IFS</code>.</li>
</ul>

<p>
Always prefer <code>"$@"</code> when iterating over arguments or array elements.
</p>
</div>
</div>
<div id="outline-container-org9cd458d" class="outline-3">
<h3 id="org9cd458d">Q: What are special variables $$ and $!?</h3>
<div class="outline-text-3" id="text-org9cd458d">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>$$</code></td>
<td class="org-left">PID of the current shell/script</td>
</tr>

<tr>
<td class="org-left"><code>$!</code></td>
<td class="org-left">PID of the last background command</td>
</tr>

<tr>
<td class="org-left"><code>$-</code></td>
<td class="org-left">Current shell option flags</td>
</tr>

<tr>
<td class="org-left"><code>$_</code></td>
<td class="org-left">Last argument of the previous command</td>
</tr>
</tbody>
</table>
</div>
</div>
