org/posts/shell-scripting.org
** Q: How do you handle errors and exit codes?

#+BEGIN_SRC bash
#!/bin/bash
set -e          # exit immediately on error
set -u          # treat unset variables as errors
set -o pipefail # catch errors in pipelines

cp source.txt dest.txt || { echo "Copy failed"; exit 1; }
#+END_SRC

Using ~set -euo pipefail~ at the top of scripts is considered best practice.

** Q: What is process substitution?

Process substitution allows you to treat the output of a command as a file.

#+BEGIN_SRC bash
# Compare output of two commands
diff <(ls dir1) <(ls dir2)

# Read from a process as if it were a file
while IFS= read -r line; do
  echo "Line: $line"
done < <(grep "ERROR" logfile.txt)
#+END_SRC

** Q: What is the difference between source (.) and executing a script?

#+BEGIN_SRC bash
source script.sh  # or: . script.sh
./script.sh
#+END_SRC

- ~source~ / ~.~ runs the script in the *current* shell — variable changes persist.
- ~./script.sh~ runs the script in a *subshell* — changes do not affect the parent shell.

** Q: How do you work with files and directories?

#+BEGIN_SRC bash
# Test conditions
[ -f file.txt ]   && echo "Is a regular file"
[ -d /tmp ]       && echo "Is a directory"
[ -r file.txt ]   && echo "Is readable"
[ -w file.txt ]   && echo "Is writable"
[ -x script.sh ]  && echo "Is executable"
[ -s file.txt ]   && echo "Is non-empty"
[ -e path ]       && echo "Exists"
#+END_SRC

** Q: How does string manipulation work in bash?

#+BEGIN_SRC bash
str="Hello, World!"

echo "${#str}"           # Length: 13
echo "${str:7:5}"        # Substring: World
echo "${str,,}"          # Lowercase: hello, world!
echo "${str^^}"          # Uppercase: HELLO, WORLD!
echo "${str/World/Bash}" # Replace first: Hello, Bash!
echo "${str//l/L}"       # Replace all:   HeLLo, WorLd!
echo "${str#Hello, }"    # Remove prefix: World!
echo "${str%!}"          # Remove suffix: Hello, World
#+END_SRC

** Q: How do you use case statements?

#+BEGIN_SRC bash
read -p "Enter a fruit: " fruit
case "$fruit" in
  apple)
    echo "You chose apple."
    ;;
  banana | mango)
    echo "You chose a tropical fruit."
    ;;
  *)
    echo "Unknown fruit."
    ;;
esac
#+END_SRC

** Q: What is IFS and how does it affect word splitting?

~IFS~ (Internal Field Separator) controls how bash splits words.
Default value is space, tab, and newline.

#+BEGIN_SRC bash
IFS=',' read -ra parts <<< "one,two,three"
for part in "${parts[@]}"; do
  echo "$part"
done
#+END_SRC

Always restore ~IFS~ after changing it to avoid side effects.

-----

* Advanced

** Q: What is the difference between soft links and hard links?

#+BEGIN_SRC bash
ln -s target.txt symlink.txt  # soft (symbolic) link
ln   target.txt hardlink.txt  # hard link
#+END_SRC

- A *soft link* is a pointer to a path — it breaks if the target is deleted or moved.
- A *hard link* is another directory entry pointing to the same inode — it survives deletion of the original filename.

** Q: How do you write robust scripts using traps?

~trap~ lets you catch signals and errors to perform cleanup before the script exits.

#+BEGIN_SRC bash
#!/bin/bash
tmpfile=$(mktemp)

cleanup() {
  echo "Cleaning up..."
  rm -f "$tmpfile"
}

trap cleanup EXIT        # runs on any exit
trap 'echo "Interrupted"' INT  # runs on Ctrl+C (SIGINT)

echo "Working..." > "$tmpfile"
# ... rest of script ...
#+END_SRC

