public/posts/shell-scripting.html
<div id="outline-container-org8f6b69d" class="outline-3">
<h3 id="org8f6b69d">Q: How do you handle errors and exit codes?</h3>
<div class="outline-text-3" id="text-org8f6b69d">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold;">set</span> -e          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">exit immediately on error
</span><span style="font-weight: bold;">set</span> -u          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">treat unset variables as errors
</span><span style="font-weight: bold;">set</span> -o pipefail <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">catch errors in pipelines
</span>
cp source.txt dest.txt || { <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Copy failed"</span>; <span style="font-weight: bold;">exit</span> 1; }
</pre>
</div>

<p>
Using <code>set -euo pipefail</code> at the top of scripts is considered best practice.
</p>
</div>
</div>
<div id="outline-container-org31985dc" class="outline-3">
<h3 id="org31985dc">Q: What is process substitution?</h3>
<div class="outline-text-3" id="text-org31985dc">
<p>
Process substitution allows you to treat the output of a command as a file.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Compare output of two commands
</span>diff &lt;(ls dir1) &lt;(ls dir2)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Read from a process as if it were a file
</span><span style="font-weight: bold;">while</span> <span style="font-weight: bold; font-style: italic;">IFS</span>= read -r line; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Line: $line"</span>
<span style="font-weight: bold;">done</span> &lt; &lt;(grep <span style="font-style: italic;">"ERROR"</span> logfile.txt)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9ff6b11" class="outline-3">
<h3 id="org9ff6b11">Q: What is the difference between source (.) and executing a script?</h3>
<div class="outline-text-3" id="text-org9ff6b11">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">source</span> script.sh  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">or: . script.sh
</span>./script.sh
</pre>
</div>

<ul class="org-ul">
<li><code>source</code> / <code>.</code> runs the script in the <b>current</b> shell — variable changes persist.</li>
<li><code>./script.sh</code> runs the script in a <b>subshell</b> — changes do not affect the parent shell.</li>
</ul>
</div>
</div>
<div id="outline-container-org2ee91c9" class="outline-3">
<h3 id="org2ee91c9">Q: How do you work with files and directories?</h3>
<div class="outline-text-3" id="text-org2ee91c9">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Test conditions
</span>[ -f file.txt ]   &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Is a regular file"</span>
[ -d /tmp ]       &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Is a directory"</span>
[ -r file.txt ]   &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Is readable"</span>
[ -w file.txt ]   &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Is writable"</span>
[ -x script.sh ]  &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Is executable"</span>
[ -s file.txt ]   &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Is non-empty"</span>
[ -e path ]       &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Exists"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge7296b6" class="outline-3">
<h3 id="orge7296b6">Q: How does string manipulation work in bash?</h3>
<div class="outline-text-3" id="text-orge7296b6">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">str</span>=<span style="font-style: italic;">"Hello, World!"</span>

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${#str}"</span>           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Length: 13
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${str:7:5}"</span>        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Substring: World
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${str,,}"</span>          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Lowercase: hello, world!
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${str^^}"</span>          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Uppercase: HELLO, WORLD!
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${str/World/Bash}"</span> <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Replace first: Hello, Bash!
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${str//l/L}"</span>       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Replace all:   HeLLo, WorLd!
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${str#Hello, }"</span>    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove prefix: World!
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${str%!}"</span>          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove suffix: Hello, World</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0972f15" class="outline-3">
<h3 id="org0972f15">Q: How do you use case statements?</h3>
<div class="outline-text-3" id="text-org0972f15">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">read</span> -p <span style="font-style: italic;">"Enter a fruit: "</span> fruit
<span style="font-weight: bold;">case</span> <span style="font-style: italic;">"$fruit"</span><span style="font-weight: bold;"> in</span>
  apple)
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"You chose apple."</span>
    ;;
  banana | mango)
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"You chose a tropical fruit."</span>
    ;;
  *)
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Unknown fruit."</span>
    ;;
<span style="font-weight: bold;">esac</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7dc7ea" class="outline-3">
<h3 id="orgb7dc7ea">Q: What is IFS and how does it affect word splitting?</h3>
<div class="outline-text-3" id="text-orgb7dc7ea">
<p>
<code>IFS</code> (Internal Field Separator) controls how bash splits words.
Default value is space, tab, and newline.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">IFS</span>=<span style="font-style: italic;">','</span> read -ra parts &lt;&lt;&lt; <span style="font-style: italic;">"one,two,three"</span>
<span style="font-weight: bold;">for</span> part<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"${parts[@]}"</span>; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$part"</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>

<p>
Always restore <code>IFS</code> after changing it to avoid side effects.
</p>

<hr>
</div>
</div>
</div>
<div id="outline-container-org9c3e44d" class="outline-2">
<h2 id="org9c3e44d">Advanced</h2>
<div class="outline-text-2" id="text-org9c3e44d">
</div>
<div id="outline-container-org5e288cb" class="outline-3">
<h3 id="org5e288cb">Q: What is the difference between soft links and hard links?</h3>
<div class="outline-text-3" id="text-org5e288cb">
<div class="org-src-container">
<pre class="src src-bash">ln -s target.txt symlink.txt  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">soft (symbolic) link
</span>ln   target.txt hardlink.txt  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">hard link</span>
</pre>
</div>

<ul class="org-ul">
<li>A <b>soft link</b> is a pointer to a path — it breaks if the target is deleted or moved.</li>
<li>A <b>hard link</b> is another directory entry pointing to the same inode — it survives deletion of the original filename.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc86116d" class="outline-3">
<h3 id="orgc86116d">Q: How do you write robust scripts using traps?</h3>
<div class="outline-text-3" id="text-orgc86116d">
<p>
<code>trap</code> lets you catch signals and errors to perform cleanup before the script exits.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">tmpfile</span>=$(mktemp)

<span style="font-weight: bold;">cleanup</span>() {
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Cleaning up..."</span>
  rm -f <span style="font-style: italic;">"$tmpfile"</span>
}

<span style="font-weight: bold;">trap</span> cleanup EXIT        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">runs on any exit
</span><span style="font-weight: bold;">trap</span> <span style="font-style: italic;">'echo "Interrupted"'</span> INT  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">runs on Ctrl+C (SIGINT)
</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Working..."</span> &gt; <span style="font-style: italic;">"$tmpfile"</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">... rest of script ...</span>
</pre>
</div>
</div>
</div>
