org/posts/shell-scripting.org
** Q: How do named pipes (FIFOs) work?

#+BEGIN_SRC bash
mkfifo mypipe
echo "Hello from producer" > mypipe &   # writer (runs in background)
cat mypipe                               # reader (blocks until writer writes)
rm mypipe
#+END_SRC

Named pipes allow inter-process communication between unrelated processes.

** Q: How do you implement a mutex/lock in shell scripts?

#+BEGIN_SRC bash
LOCKFILE="/tmp/myscript.lock"

acquire_lock() {
  if ! mkdir "$LOCKFILE" 2>/dev/null; then
    echo "Script is already running. Exiting."
    exit 1
  fi
}

release_lock() {
  rmdir "$LOCKFILE"
}

trap release_lock EXIT
acquire_lock

echo "Critical section running..."
#+END_SRC

Using ~mkdir~ for locking is atomic on most file systems, making it safer than ~touch~.

** Q: How do you run commands in parallel and wait for them?

#+BEGIN_SRC bash
#!/bin/bash
pids=()

for i in 1 2 3 4; do
  sleep "$i" &
  pids+=($!)
done

for pid in "${pids[@]}"; do
  wait "$pid" && echo "PID $pid finished OK" || echo "PID $pid failed"
done
#+END_SRC

~&~ runs a command in the background, ~wait~ waits for it, ~$!~ captures its PID.

** Q: What is a subshell and how does it affect variable scope?

A subshell is a child process created by the current shell.
Variables set in a subshell are not visible in the parent.

#+BEGIN_SRC bash
x=10
(
  x=20
  echo "Inside subshell: x=$x"   # 20
)
echo "Outside subshell: x=$x"    # 10 — unchanged
#+END_SRC

Subshells are created by ~(...)~, pipelines, command substitution, and background jobs.

** Q: How do you handle long options and flags with getopts / getopt?

#+BEGIN_SRC bash
#!/bin/bash
usage() { echo "Usage: $0 [-n name] [-v]" >&2; exit 1; }

verbose=0
name=""

while getopts ":n:v" opt; do
  case $opt in
    n) name="$OPTARG" ;;
    v) verbose=1 ;;
    :) echo "Option -$OPTARG requires an argument." >&2; usage ;;
   \?) echo "Invalid option: -$OPTARG" >&2; usage ;;
  esac
done

shift $((OPTIND - 1))
echo "Name: $name, Verbose: $verbose, Remaining args: $*"
#+END_SRC

~getopts~ is POSIX-compliant and built-in.
Use ~getopt~ (external) for long options (~--name~).

** Q: How does coproc work in bash?

~coproc~ creates a coprocess — a background process with bidirectional pipes to the current shell.

#+BEGIN_SRC bash
coproc my_proc { cat; }

echo "Hello" >&"${my_proc[1]}"   # write to coprocess stdin
read line <&"${my_proc[0]}"      # read from coprocess stdout
echo "Got: $line"
#+END_SRC

Useful when you need a persistent two-way communication channel with a child process.

** Q: How do you use associative arrays (hash maps)?

Associative arrays require bash 4.0+.

#+BEGIN_SRC bash
declare -A capitals

capitals["France"]="Paris"
capitals["Germany"]="Berlin"
capitals["Japan"]="Tokyo"

echo "${capitals["France"]}"       # Paris

# Iterate over key-value pairs
for country in "${!capitals[@]}"; do
  echo "$country -> ${capitals[$country]}"
done
#+END_SRC

** Q: How do you profile and debug a shell script?

#+BEGIN_SRC bash
#!/bin/bash
set -x    # print each command and its expanded form before execution
set -v    # print shell input lines as they are read

# Measure execution time of a section
time {
  for i in $(seq 1 1000); do
    :
  done
}
#+END_SRC

You can also run a script with ~bash -x script.sh~ without modifying it.
Use ~PS4='+(${BASH_SOURCE}:${LINENO}): '~ to include file and line number in trace output.

