public/posts/shell-scripting.html
<div id="outline-container-org1b2b579" class="outline-3">
<h3 id="org1b2b579">Q: How do named pipes (FIFOs) work?</h3>
<div class="outline-text-3" id="text-org1b2b579">
<div class="org-src-container">
<pre class="src src-bash">mkfifo mypipe
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Hello from producer"</span> &gt; mypipe &amp;   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">writer (runs in background)
</span>cat mypipe                               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">reader (blocks until writer writes)
</span>rm mypipe
</pre>
</div>

<p>
Named pipes allow inter-process communication between unrelated processes.
</p>
</div>
</div>
<div id="outline-container-orgd0822f8" class="outline-3">
<h3 id="orgd0822f8">Q: How do you implement a mutex/lock in shell scripts?</h3>
<div class="outline-text-3" id="text-orgd0822f8">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">LOCKFILE</span>=<span style="font-style: italic;">"/tmp/myscript.lock"</span>

<span style="font-weight: bold;">acquire_lock</span>() {
  <span style="font-weight: bold;">if</span> ! mkdir <span style="font-style: italic;">"$LOCKFILE"</span> 2&gt;/dev/null; <span style="font-weight: bold;">then</span>
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Script is already running. Exiting."</span>
    <span style="font-weight: bold;">exit</span> 1
  <span style="font-weight: bold;">fi</span>
}

<span style="font-weight: bold;">release_lock</span>() {
  rmdir <span style="font-style: italic;">"$LOCKFILE"</span>
}

<span style="font-weight: bold;">trap</span> release_lock EXIT
acquire_lock

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Critical section running..."</span>
</pre>
</div>

<p>
Using <code>mkdir</code> for locking is atomic on most file systems, making it safer than <code>touch</code>.
</p>
</div>
</div>
<div id="outline-container-orgd15e51c" class="outline-3">
<h3 id="orgd15e51c">Q: How do you run commands in parallel and wait for them?</h3>
<div class="outline-text-3" id="text-orgd15e51c">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">pids</span>=()

<span style="font-weight: bold;">for</span> i<span style="font-weight: bold;"> in</span> 1 2 3 4; <span style="font-weight: bold;">do</span>
  sleep <span style="font-style: italic;">"$i"</span> &amp;
  <span style="font-weight: bold; font-style: italic;">pids</span>+=($<span style="font-weight: bold; font-style: italic;">!</span>)
<span style="font-weight: bold;">done</span>

<span style="font-weight: bold;">for</span> pid<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"${pids[@]}"</span>; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">wait</span> <span style="font-style: italic;">"$pid"</span> &amp;&amp; <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"PID $pid finished OK"</span> || <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"PID $pid failed"</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>

<p>
<code>&amp;</code> runs a command in the background, <code>wait</code> waits for it, <code>$!</code> captures its PID.
</p>
</div>
</div>
<div id="outline-container-org6635a10" class="outline-3">
<h3 id="org6635a10">Q: What is a subshell and how does it affect variable scope?</h3>
<div class="outline-text-3" id="text-org6635a10">
<p>
A subshell is a child process created by the current shell.
Variables set in a subshell are not visible in the parent.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">x</span>=10
(
  <span style="font-weight: bold; font-style: italic;">x</span>=20
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Inside subshell: x=$x"</span>   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">20
</span>)
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Outside subshell: x=$x"</span>    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">10 &#8212; unchanged</span>
</pre>
</div>

<p>
Subshells are created by <code>(...)</code>, pipelines, command substitution, and background jobs.
</p>
</div>
</div>
<div id="outline-container-orgacbb92c" class="outline-3">
<h3 id="orgacbb92c">Q: How do you handle long options and flags with getopts / getopt?</h3>
<div class="outline-text-3" id="text-orgacbb92c">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold;">usage</span>() { <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Usage: $0 [-n name] [-v]"</span> &gt;&amp;2; <span style="font-weight: bold;">exit</span> 1; }

<span style="font-weight: bold; font-style: italic;">verbose</span>=0
<span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">""</span>

<span style="font-weight: bold;">while </span><span style="font-weight: bold;">getopts</span> <span style="font-style: italic;">":n:v"</span> opt; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">case</span> $<span style="font-weight: bold; font-style: italic;">opt</span><span style="font-weight: bold;"> in</span>
    n) <span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"$OPTARG"</span> ;;
    v) <span style="font-weight: bold; font-style: italic;">verbose</span>=1 ;;
    :) <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Option -$OPTARG requires an argument."</span> &gt;&amp;2; usage ;;
   <span style="font-style: italic;">\?</span>) <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Invalid option: -$OPTARG"</span> &gt;&amp;2; usage ;;
  <span style="font-weight: bold;">esac</span>
<span style="font-weight: bold;">done</span>

<span style="font-weight: bold;">shift</span> $((OPTIND - 1))
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Name: $name, Verbose: $verbose, Remaining args: $*"</span>
</pre>
</div>

<p>
<code>getopts</code> is POSIX-compliant and built-in.
Use <code>getopt</code> (external) for long options (<code>--name</code>).
</p>
</div>
</div>
<div id="outline-container-orga964fab" class="outline-3">
<h3 id="orga964fab">Q: How does coproc work in bash?</h3>
<div class="outline-text-3" id="text-orga964fab">
<p>
<code>coproc</code> creates a coprocess — a background process with bidirectional pipes to the current shell.
</p>

<div class="org-src-container">
<pre class="src src-bash">coproc my_proc { cat; }

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Hello"</span> &gt;&amp;<span style="font-style: italic;">"${my_proc[1]}"</span>   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">write to coprocess stdin
</span><span style="font-weight: bold;">read</span> line &lt;&amp;<span style="font-style: italic;">"${my_proc[0]}"</span>      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">read from coprocess stdout
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Got: $line"</span>
</pre>
</div>

<p>
Useful when you need a persistent two-way communication channel with a child process.
</p>
</div>
</div>
<div id="outline-container-orga03bb71" class="outline-3">
<h3 id="orga03bb71">Q: How do you use associative arrays (hash maps)?</h3>
<div class="outline-text-3" id="text-orga03bb71">
<p>
Associative arrays require bash 4.0+.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">declare</span> -A capitals

<span style="font-weight: bold; font-style: italic;">capitals</span>[<span style="font-style: italic;">"France"</span>]=<span style="font-style: italic;">"Paris"</span>
<span style="font-weight: bold; font-style: italic;">capitals</span>[<span style="font-style: italic;">"Germany"</span>]=<span style="font-style: italic;">"Berlin"</span>
<span style="font-weight: bold; font-style: italic;">capitals</span>[<span style="font-style: italic;">"Japan"</span>]=<span style="font-style: italic;">"Tokyo"</span>

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${capitals["</span>France<span style="font-style: italic;">"]}"</span>       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Paris
</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Iterate over key-value pairs
</span><span style="font-weight: bold;">for</span> country<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"${!capitals[@]}"</span>; <span style="font-weight: bold;">do</span>
  <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$country -&gt; ${capitals[$country]}"</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0a20569" class="outline-3">
<h3 id="org0a20569">Q: How do you profile and debug a shell script?</h3>
<div class="outline-text-3" id="text-org0a20569">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold;">set</span> -x    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">print each command and its expanded form before execution
</span><span style="font-weight: bold;">set</span> -v    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">print shell input lines as they are read
</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Measure execution time of a section
</span><span style="font-weight: bold;">time</span> {
  <span style="font-weight: bold;">for</span> i<span style="font-weight: bold;"> in</span> $(seq 1 1000); <span style="font-weight: bold;">do</span>
    :
  <span style="font-weight: bold;">done</span>
}
</pre>
</div>

<p>
You can also run a script with <code>bash -x script.sh</code> without modifying it.
Use <code>PS4='+(${BASH_SOURCE}:${LINENO}): '</code> to include file and line number in trace output.
</p>
</div>
</div>
