org/posts/shell-scripting.org
** Q: What are the differences between exec, fork, and source in shell?

| Mechanism   | Description                                                         |
|-------------+---------------------------------------------------------------------|
| ~fork~      | Shell creates a child process; parent waits for it to finish        |
| ~exec~      | Replaces the current process image — no child is created            |
| ~source/. ~ | Runs commands in the current shell process; no new process created  |

#+BEGIN_SRC bash
exec /bin/bash    # replaces current shell — the original process is gone
#+END_SRC

** Q: How do you write a self-contained script that detects its own location?

#+BEGIN_SRC bash
#!/bin/bash
SCRIPT_DIR="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
echo "Script is located in: $SCRIPT_DIR"
#+END_SRC

This works correctly even when the script is sourced, symlinked, or called from a different directory.

** Q: What are some security best practices for shell scripting?

1. *Always quote variables* — ~"$var"~ prevents word splitting and globbing issues.
2. *Validate input* — never trust user-supplied data.
3. *Avoid ~eval~* — it executes arbitrary code and is a common injection vector.
4. *Use absolute paths* for critical commands in scripts run as root.
5. *Restrict permissions* — scripts that contain secrets should not be world-readable.
6. *Use ~set -euo pipefail~* — catch errors early.
7. *Sanitize filenames* — use ~--~ to separate options from filenames (e.g., ~rm -- "$file"~).
8. *Prefer mktemp* for temporary files instead of predictable names.

#+BEGIN_SRC bash
# Unsafe
tmpfile="/tmp/myapp-$$"

# Safe
tmpfile=$(mktemp /tmp/myapp-XXXXXX)
#+END_SRC

-----

#+INCLUDE: "../footer.org"
