public/posts/shell-scripting.html
<div id="outline-container-org32d6180" class="outline-3">
<h3 id="org32d6180">Q: What are the differences between exec, fork, and source in shell?</h3>
<div class="outline-text-3" id="text-org32d6180">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Mechanism</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>fork</code></td>
<td class="org-left">Shell creates a child process; parent waits for it to finish</td>
</tr>

<tr>
<td class="org-left"><code>exec</code></td>
<td class="org-left">Replaces the current process image — no child is created</td>
</tr>

<tr>
<td class="org-left"><code>source/.</code></td>
<td class="org-left">Runs commands in the current shell process; no new process created</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">exec</span> /bin/bash    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">replaces current shell &#8212; the original process is gone</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org72fea6d" class="outline-3">
<h3 id="org72fea6d">Q: How do you write a self-contained script that detects its own location?</h3>
<div class="outline-text-3" id="text-org72fea6d">
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span><span style="font-weight: bold; font-style: italic;">SCRIPT_DIR</span>=<span style="font-style: italic;">"$(cd "$(dirname "${BASH_SOURCE[0]}")" &amp;&amp; pwd)"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Script is located in: $SCRIPT_DIR"</span>
</pre>
</div>

<p>
This works correctly even when the script is sourced, symlinked, or called from a different directory.
</p>
</div>
</div>
<div id="outline-container-org9e8f934" class="outline-3">
<h3 id="org9e8f934">Q: What are some security best practices for shell scripting?</h3>
<div class="outline-text-3" id="text-org9e8f934">
<ol class="org-ol">
<li><b>Always quote variables</b> — <code>"$var"</code> prevents word splitting and globbing issues.</li>
<li><b>Validate input</b> — never trust user-supplied data.</li>
<li><b>Avoid <code>eval</code></b> — it executes arbitrary code and is a common injection vector.</li>
<li><b>Use absolute paths</b> for critical commands in scripts run as root.</li>
<li><b>Restrict permissions</b> — scripts that contain secrets should not be world-readable.</li>
<li><b>Use <code>set -euo pipefail</code></b> — catch errors early.</li>
<li><b>Sanitize filenames</b> — use <code>--</code> to separate options from filenames (e.g., <code>rm -- "$file"</code>).</li>
<li><b>Prefer mktemp</b> for temporary files instead of predictable names.</li>
</ol>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Unsafe
</span><span style="font-weight: bold; font-style: italic;">tmpfile</span>=<span style="font-style: italic;">"/tmp/myapp-$$"</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Safe
</span><span style="font-weight: bold; font-style: italic;">tmpfile</span>=$(mktemp /tmp/myapp-XXXXXX)
</pre>
</div>

<hr>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
        <li><a href="https://www.youtube.com/@borislavdostumski6006" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> YouTube</a></li>
    </ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
